[
  {"text": "Is 'The Office' the best sitcom of all time? Discuss."},
  {"text": "The impact of Beyoncé's 'Lemonade' on the music industry was monumental."},
  {"text": "What are your thoughts on the latest season of 'Stranger Things'?"},
  {"text": "The rise of TikTok has completely changed the landscape of social media and internet culture."},
  {"text": "That plot twist in the latest Marvel movie was completely unexpected."},
  {"text": "I'm still not over the 'Red Wedding' episode of 'Game of Thrones'."},
  {"text": "The fashion in 'Euphoria' has had a huge influence on Gen Z style."},
  {"text": "Who is the most iconic movie villain of the 21st century?"},
  {"text": "The 'Harry Potter' series defined a generation of readers and moviegoers."},
  {"text": "Debate: Is reality TV a legitimate form of entertainment or 'trash television'?"},
  {"text": "The Oscar for Best Picture should have gone to a different film this year."},
  {"text": "How has the representation of LGBTQ+ characters in television evolved over the past decade?"},
  {"text": "The cultural significance of 'Star Wars' is undeniable."},
  {"text": "Let's talk about the most overrated musical artists of our time."},
  {"text": "The finale of 'Breaking Bad' is a masterclass in storytelling."},
  {"text": "What's a video game that you think deserves a film adaptation?"},
  {"text": "The nostalgia for 90s and 2000s pop culture is at an all-time high."},
  {"text": "The social commentary in Jordan Peele's films is brilliant."},
  {"text": "Analyzing the lyrical genius of Kendrick Lamar's 'To Pimp a Butterfly'. [35]"},
  {"text": "Do you prefer the Marvel Cinematic Universe or the DC Extended Universe?"},
  {"text": "The influence of K-Pop on global music trends is growing every year. [7]"},
  {"text": "What makes a meme go viral?"},
  {"text": "The 'Friends' reunion special was a trip down memory lane. [6]"},
  {"text": "Is it just me, or are movie trailers giving away too much of the plot lately?"},
  {"text": "The way 'Black Mirror' predicts future technology is both fascinating and terrifying."},
  {"text": "Unpacking the symbolism in the final scene of 'Inception'."},
  {"text": "The rise of streaming services has led to a golden age of television. [16]"},
  {"text": "Let's rank the James Bond actors from best to worst."},
  {"text": "The evolution of Disney princesses and their impact on young audiences."},
  {"text": "Was the 'Game of Thrones' finale a satisfying conclusion to the series? [13]"},
  {"text": "The cultural impact of 'Pulp Fiction' and Quentin Tarantino's filmmaking style. [14]"},
  {"text": "What's the most iconic 'Saturday Night Live' sketch of all time?"},
  {"text": "The 'John Wick' franchise has revitalized the action movie genre."},
  {"text": "How do you feel about movie remakes and reboots?"},
  {"text": "The role of fashion in 'Sex and the City' was practically its own character."},
  {"text": "Analyzing the social and political themes in 'The Handmaid's Tale'."},
  {"text": "The best and worst celebrity fashion moments from the Met Gala."},
  {"text": "What is the most underrated film of the last decade?"},
  {"text": "The 'Lord of the Rings' trilogy is a cinematic masterpiece."},
  {"text": "How has celebrity culture been affected by the rise of social media? [7]"},
  {"text": "The music of the 80s is making a huge comeback in popular media."},
  {"text": "Did 'Joker' deserve all the controversy it generated? [4]"},
  {"text": "The evolution of the superhero genre in film and television. [7]"},
  {"text": "Let's discuss the most shocking reality TV moments in history."},
  {"text": "The 'Star Trek' franchise has had a lasting impact on science fiction. [16]"},
  {"text": "What are your predictions for the next big pop culture trend?"},
  {"text": "The cultural reset that was Lady Gaga's meat dress at the 2010 VMAs. [33]"},
  {"text": "Is 'The Crown' a historically accurate portrayal of the British royal family?"},
  {"text": "The lasting legacy of 'The Simpsons' on animated television."},
  {"text": "The best musical performances from the Super Bowl halftime show."},
  {"text": "How has the concept of 'fandom' changed in the internet age?"},
  {"text": "The viral marketing for the 'Barbie' movie was genius."},
  {"text": "Analyzing the commentary on class and society in 'Parasite'. [11]"},
  {"text": "What are the most quotable lines from the 'Mean Girls' movie?"},
  {"text": "The influence of 'RuPaul's Drag Race' on mainstream culture. [27]"},
  {"text": "Is it ethical for actors to undergo extreme physical transformations for roles?"},
  {"text": "The 'Hunger Games' series sparked a wave of dystopian young adult fiction. [10]"},
  {"text": "The most memorable celebrity interviews and talk show moments."},
  {"text": "The impact of anime and manga on Western pop culture. [7]"},
  {"text": "What's the best concert you've ever been to?"},
  {"text": "The use of music in Quentin Tarantino's films is always iconic."},
  {"text": "How do you feel about celebrities getting involved in politics?"},
  {"text": "The 'Twilight' saga: a cultural phenomenon or a cringey teen romance?"},
  {"text": "The evolution of horror films, from classic slashers to elevated horror."},
  {"text": "What is the most iconic music video of all time? [16]"},
  {"text": "The 'Fast & Furious' franchise has become a global blockbuster phenomenon."},
  {"text": "The rise and fall of celebrity-owned restaurants."},
  {"text": "How has the comedy special format changed with the rise of streaming platforms?"},
  {"text": "The cultural significance of 'Sesame Street' and its impact on children's television."},
  {"text": "What are some of the most memorable Oscar acceptance speeches?"},
  {"text": "The 'Scream' franchise successfully deconstructed the horror genre."},
  {"text": "Is 'Die Hard' a Christmas movie? The eternal debate continues."},
  {"text": "The impact of 'Hamilton' on Broadway and its fusion of hip-hop and history. [33]"},
  {"text": "The best and worst live-action adaptations of animated films."},
  {"text": "The role of social media in amplifying celebrity scandals and controversies."},
  {"text": "The evolution of late-night talk shows in the digital age."},
  {"text": "What's your favorite conspiracy theory about a celebrity or movie?"},
  {"text": "The cultural impact of 'The Matrix' and its influence on science fiction films. [4]"},
  {"text": "The most iconic and cringeworthy moments from the MTV Video Music Awards."},
  {"text": "The 'James Bond' theme song: which artist had the best one?"},
  {"text": "How has the true-crime genre exploded in popularity in recent years?"},
  {"text": "The representation of mental health in films and television shows."},
  {"text": "The most successful and disastrous celebrity brand endorsements."},
  {"text": "The cultural legacy of 'I Love Lucy' and its impact on the sitcom format. [16]"},
  {"text": "What are some of the most iconic album covers of all time?"},
  {"text": "The 'Toy Story' franchise has consistently delivered heartfelt and critically acclaimed films."},
  {"text": "The rise of 'stan' culture and its impact on fan-celebrity relationships."},
  {"text": "How has the portrayal of journalists and the media changed in film and television?"},
  {"text": "The best and worst musical episodes of non-musical TV shows."},
  {"text": "The cultural phenomenon of 'Tiger King' during the 2020 lockdown. [11, 37]"},
  {"text": "The evolution of the 'final girl' trope in horror movies."},
  {"text": "What are some of the most memorable 'mic drop' moments in pop culture history?"},
  {"text": "The 'Mission: Impossible' series has consistently raised the bar for action stunts."},
  {"text": "The impact of 'Glee' on the popularity of show choirs and musical television."},
  {"text": "The most iconic catchphrases from television shows that have entered everyday language. [1, 17]"},
  {"text": "How have cooking competition shows influenced foodie culture?"},
  {"text": "The 'Jurassic Park' franchise and its groundbreaking use of special effects."},
  {"text": "The rise of nostalgia-baiting in modern film and television."},
  {"text": "What's a pop culture moment that you'll never forget?"},
  {"text": "The enduring popularity of the 'superhero' narrative in modern media."}
]